{
  "education": [
    {
      "awards_achievements": [
        "GPA: 4.19/5.0"
      ],
      "degree": "Bachelor of Sciences",
      "department": "Computer Science",
      "duration": "2011-2015",
      "school_name": "Ebonyi State University"
    },
    {
      "awards_achievements": [
        "GPA: 3.5/4",
        "African Capacity Building Foundation Scholarship Award"
      ],
      "degree": "Master of Sciences",
      "department": "Computer Science",
      "duration": "2016-2017",
      "school_name": "African University of Science and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_NkirukaOdu",
  "highlighted_projects": [
    {
      "description": "Implemented an XGBoost model to predict customers who will default on their credit card payments. The project was implemented using Python, Git, Dash, and an XGBoost machine learning model. The predictors used include Limited Balance, Total bill, Total paid, Payment Level, Age, and Education level. The model was trained and tested using a real-world dataset obtained from the UCI repository. The predictive result showed a 94% accuracy. The project was deployed to Heroku..",
      "git_url": "https://github.com/write2nk/Unit2-example",
      "name": "Credit card default Predictor"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Linux Cluster Resource Monitoring App is used by the linux cluster agents to collect hardware specifications and resource usage information.  I prepared the business requirement documents (BRD) to show the basic requirements, the project objectives, the need statement, project scope, the programming language, identified the  stakeholders and performed elicitation through open interview, drew the project timeline/milestone/deadline and the cost benefit analysis. I also prepared the System requirement document (SRD) to show the  behaviour of the system, the functional and non-functional requirement, created data models and ER-diagram to show how different entities are related and the use case diagram to show the functional behaviours .",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Nkiruka Odu",
  "others": [
    {
      "bullets": [
        "Udacity Frontend Web Development (2018)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Volunteer, Masakhane NER data annotation",
        "Data Science Training, ICTP"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an Agile/scrum environment to implement software solutions, prepared BRD and SRD following the system design best practices using techniques such as data modeling, data analysis,  data mapping, solution design tools such as use case diagram, flowchart, activity diagram, and technologies like SQL, Python, Git.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Nile University",
      "description": "Led to planning and coordination of programs and other academic activities. Prepared funding proposals for grants and other sources. ",
      "duration": "2019 - 2021",
      "title": "Asst. Program Coordinator"
    }
  ],
  "skills": {
    "Business Skills": [
      "Interpersonal",
      "Communication",
      "Documentaion/Presentation",
      "Requirement Elicitation",
      "Agile/Scrum"
    ],
    "Technical Skills": [
      "RDBMS/SQL",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Python",
      "Excel",
      "Google Cloud Platform",
      "Bash",
      "Git",
      "Docker"
    ]
  },
  "summary": "Interfacing between business and technology interests me a lot. I obtained a master's degree in computer science from the African University of Science and Technology. I have about 3 years of working experience as an assistant program coordinator at Nile University; where I worked with other team members to prepare proposals, projects, and organize other academic activities. This experience got me exposed to great working culture and best industrial practices which improved my creative thinking, communication,  and documentation skills. Working as a junior developer at Jarvis exposed me to the entire spectrum of software development processes, having the great opportunity to work in an Agile/Scrum environment where I collaborated with other team members to develop business solutions using technologies like Python, Pandas, Numpy, SQL, Bash, and Docker. Currently, I have a passion to work in an environment where I can actively collaborate with other team members to develop efficient business information technology systems by fostering the active use of emerging technologies and techniques to help them achieve strategic business goals. Therefore, I am currently seeking a full-time role as a Business System Analyst (BSA).  I am proficient in Python, SQL, data modeling, data analytics, and statistics. I am an excellent communicator, together with good documentation and presentation skills, which is required to liaise well with the stakeholders, especially during requirement elicitation and analysis. Learning new skills and how to apply them to solve real-world problems motivates me a lot!."
}
